{
  "main": {
    "name":"Peter Gomez",
    "address":{
        "city":"Tallahassee",
        "state":"Florida"
    },
    "occupation":"Full-stack Engineer, Computer Scientist, and Educator",
    "description":"Problem solver for fun and profit",
    "image":"profilepic.webp",
    "bio": [
      "I'm a senior computer science student at Florida State University. I strive to be a well-rounded developer by independently studying full-stack development, programming languages, and passing this knowledge onto others. Currently, I'm working as a full-stack engineer with Chartmetric, a high-profile music analytics company. I also provide private tutoring sessions, teaching subjects from object-oriented programming and data structures with C++ to UNIX administration and system configuration.",
      "When I'm not programming you can find me playing with my cats, gaming with my wife, or playing guitar."
    ],
    "contactmessage":"Find my contact info below. Email is the most reliable way to reach me but I check all social media regularly.",
    "email": "fadedlamp42@gmail.com",
    "phone": "786-662-9918",
    "website": "http://www.petergomez.xyz",
    "resumedownload":"Gomez_Pedro.pdf",
    "social":[
      {
        "name":"github",
        "url":"https://github.com/fadedlamp42",
        "className":"fa fa-github"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/peter-gomez-733019175/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"facebook",
        "url":"https://www.facebook.com/fadedlamp42",
        "className":"fa fa-facebook"
      }
    ]
  },
  "resume":{
    "skillmessage":"I've aquired hands-on experience with server administration, database management, data science, and operating systems.",
    "education":[
      {
        "school":"Florida State University",
        "degree":"B.S. in Computer Science, Minor in Interdisciplinary Sciences",
        "graduated":"April 2022",
        "gpa":"GPA: 3.7",
        "description":"FSU's degree program has equipped me with a deep understanding of C++, the theory of programming languages, and basic system administration."
      }
    ],
    "work":[
      {
        "company":"Chartmetric",
        "title":"Back-end Engineering Intern / Full-stack Engineer",
        "years":"June 2021 - Present",
        "description":"Fast-paced, results-focused, Agile development strategy and cross-team collaboration to develop new features and fix nuanced issues. Daily work with Node.js, Express, PostgreSQL, ElasticSearch, Snowflake, and Docker. Implemented a complete Stripe Checkout integration to allow payments from new sources and improve customer experience."
      },
      {
        "company":"Pokezon",
        "title":"Contract Full-stack Engineer",
        "years":"March 2021 - Present",
        "description":"Full server and code migration from CentOS-based LAMP stack to Debian-based NERP stack, CI/CD infrastructure, and NewRelic APM. Worked as a solo engineer for over 6 months before launch to completely rewrite a 10+ year-old code base using modern JavaScript, Go, and scalable infrastructure."
      },
      {
        "company":"Florida Digital Service",
        "title":"Computer Science Intern",
        "years":"January 2021 - June 2021",
        "description":"Greenfield development of full-stack Java EE 8 CRUD web applications. Gained extensive experience with Wildfly, PostgreSQL, Docker, Kubernetes, and IntelliJ IDEA. Produced extensive documentation which details project setup, usage, and philosophy. Spear-headed adoption of Test Driven Development strategies and tooling."
      },
      {
        "company":"Florida State University",
        "title":"Computer Science and Math Tutor",
        "years":"October 2019 - December 2020",
        "description":"Appointment-based and group tutoring providing guidance and mentorship to other students. Topics include data structures, object-oriented programming, introductions to C++/Java/UNIX, discrete mathematics and college algebra."
      }
    ],
    "skills":[
      {
        "name":"JavaScript",
        "level":"95%"
      },
      {
        "name":"UNIX Administration",
        "level":"93%"
      },
      {
        "name":"Containers (Docker/Kubernetes)",
        "level":"92%"
      },
      {
        "name":"Python",
        "level":"90%"
      },
      {
        "name":"HTML/CSS",
        "level":"89%"
      },
      {
        "name":"Node.js",
        "level":"87%"
      },
      {
        "name":"Golang",
        "level":"86%"
      },
      {
        "name":"SQL",
        "level":"85%"
      },
      {
        "name":"C++",
        "level":"80%"
      },
      {
        "name":"C",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Pokezon",
        "category":"E-commerce platform dedicated to selling fully-customizable Pokemon",
        "image":"pokezon.png",
        "url":"https://pokezon.com"
      },
      {
        "title":"duedate",
        "category":"CLI tool for tracking tasks and due dates",
        "image":"due.png",
        "url":"https://www.github.com/fadedlamp42/duedate"
      },
      {
        "title":"gostatus",
        "category":"Modular Linux status monitor written in Go",
        "image":"gostatus.png",
        "url":"https://github.com/fadedlamp42/gostatus"
      },
      {
        "title":"MindBigData Exploration",
        "category":"An exercise in batch processing and visualizing a large data set",
        "image":"mbd.png",
        "url":"https://www.github.com/fadedlamp42/mbd-processing"
      },
      {
        "title":"dwm",
        "category":"My highly-customized build of a Linux window manager written in C",
        "image":"dwm.png",
        "url":"https://www.github.com/fadedlamp42/dwm"
      },
      {
        "title":"Animal Crossing Item Lister",
        "category":"Web scraping script to generate a formatted table from a live website",
        "image":"acil.png",
        "url":"https://www.github.com/fadedlamp42/acnh-item-lister"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Peter was truly a diamond in the rough. When I first met him, I saw so much potential in him that I just knew he would be so valuable to the company and a great colleague to work with. From day 1 of meeting him, he just constantly impressed me on a daily basis and was just a great honor to watch him grow into what he is today. If you haven't reached out to him already, don't hesitate to reach out! Peter is the cream of the crop and a huge team player. The sky is the limit in what he can do and I would love to work with Peter again in the future!",
        "user":"Victor Phung",
        "title":"Senior Software Engineer at Chartmetric",
        "email":"vcphng@hotmail.com"
      },
      {
        "text":"Peter worked for us as a peer tutor in computer science for the past two years, and is one of our finest employees. He is knowledgeable in his trade, adaptable to change and adversity, and always proactive in contributing to the team. I can rely on him 100% to make suggestions for the improvement of our program, help students in need one-on-one or in a group, and to get the job done whatever it may be.",
        "user":"Dr. Shane H. Hockin",
        "title":"Program Coordinator at FSU",
        "email":"shockin@fsu.edu"
      },
      {
        "text":"Peter has been a great addition to our online ACM club and an excellent Ambassador for the Tallahassee Campus. He has motivated and worked well with students of all skill levels. His passion for computer science has been infectious and a major driving force behind our group projects. He has been one of the most reliable, hardworking, and engaging members of our club.",
        "user":"Amer Delic",
        "title":"Former President of the Online ACM Club",
        "email":"amer.delic777@gmail.com"
      }
    ]
  }
}
